# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# From BiliBili 魔鬼面具
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, C2f_DynamicFilter, [128, 160]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, C2f_DynamicFilter, [256, 80]]
  - [-1, 1, Conv, [384, 3, 2]]  # 5-P4/16
  - [-1, 1, C2f_DynamicFilter, [384, 40]]
  - [-1, 1, Conv, [384, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f_DynamicFilter, [384, 20]]

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 9
  - [-1, 1, Conv, [256, 1, 1]]  # 10, Y5, lateral_convs.0

  - [-1, 1, HFP, [None, [8, 8], False]] # 11-P5

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12-P4
  - [6, 1, HFP, [None, [8, 8], False]] # 13-P4
  - [[-1, 13], 1, SDP, [256, [20, 20]]] # 14-P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15-P3
  - [4, 1, HFP, [[0.25, 0.25], [8, 8], True]] # 16-P3
  - [[-1, 16], 1, SDP, [256, [20, 20]]] # 17-P3

  - [12, 1, nn.Upsample, [None, 2, "nearest"]] # 18-P4
  - [-1, 1, Conv, [256, 1]] # 19-P4
  - [[-1, 15], 1, Add, []] # 20-P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 21-P3
  - [-1, 1, Conv, [256, 1]] # 22-P3
  - [[-1, 18], 1, Add, []] # 23-P3

  - [12, 1, Conv, [256, 3]] # 24-P5
  - [21, 1, Conv, [256, 3]] # 25-P4
  - [24, 1, Conv, [256, 3]] # 26-P3

  - [[25, 26, 27], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)
