# Ultralytics YOLO ?, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# From BiliBili Ä§¹íÃæ¾ß
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, C2f_DynamicFilter, [128, 160]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, C2f_DynamicFilter, [256, 80]]
  - [-1, 1, Conv, [384, 3, 2]]  # 5-P4/16
  - [-1, 1, C2f_DynamicFilter, [384, 40]]
  - [-1, 1, Conv, [384, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f_DynamicFilter, [384, 20]]

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 9
  - [-1, 1, Conv, [256, 1, 1]]  # 10, Y5, lateral_convs.0 P5-32

  - [6, 1, Conv, [256, 1, 1]] # 11 P4-16
  - [4, 1, Conv, [256, 1, 1]] # 12 P3-8

  - [[13, 12, 11], 1, CrossLayerChannelAttention, []] # 13
  - [14, 1, GetIndexOutput, [0]] # 14-P3/8
  - [14, 1, GetIndexOutput, [1]] # 15-P4/16
  - [14, 1, GetIndexOutput, [2]] # 16-P5/32

  - [[15, 16, 17], 1, CrossLayerSpatialAttention, []] # 17
  - [18, 1, GetIndexOutput, [0]] # 18-P3/8
  - [18, 1, GetIndexOutput, [1]] # 19-P4/16
  - [18, 1, GetIndexOutput, [2]] # 20-P5/32

  - [[13, 19], 1, Add, []] # 21-P3/8
  - [[12, 20], 1, Add, []] # 22-P4/16
  - [[11, 21], 1, Add, []] # 23-P5/32

  - [-1, 1, Conv, [512, 3, 2]] # 24-P6/64

  - [[22, 23, 24, 25], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)