# Ultralytics YOLO ?, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# From BiliBili Ä§¹íÃæ¾ß
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, C2f_DynamicFilter, [128, 160]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, C2f_DynamicFilter, [256, 80]]
  - [-1, 1, Conv, [384, 3, 2]]  # 5-P4/16
  - [-1, 1, C2f_DynamicFilter, [384, 40]]
  - [-1, 1, Conv, [384, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f_DynamicFilter, [384, 20]]

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 9
  - [-1, 1, Conv, [256, 1, 1]]  # 10, Y5, lateral_convs.0

  - [6, 1, Conv, [256, 3, 2]] # 11-P5/32
  - [[-1, 11], 1, Concat, [1]] # 12
  - [-1, 3, RepC3, [256, 0.5]] # 13-P5/32

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14-P4/16
  - [4, 1, Conv, [128, 3, 2]] # 15-P4/16
  - [[-1, -2, 6], 1, Concat, [1]] # 16
  - [-1, 3, RepC3, [256, 0.5]] # 17-P4/16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 18-P3/8
  - [2, 1, Conv, [64, 3, 2]] # 19-P3/8
  - [[-1, -2, 4], 1, Concat, [1]] # 20
  - [-1, 3, RepC3, [128, 0.5]] # 21-P3/8

  - [[19, -1], 1, Concat, [1]] # 22
  - [-1, 3, RepC3, [128, 0.5]] # 23-P3/8

  - [22, 1, Conv, [256, 3, 2]] # 24-P4/16
  - [24, 1, Conv, [256, 3, 2]] # 25-P4/16
  - [[-1, -2, 18, 15], 1, Concat, [1]] # 26-P4/16
  - [-1, 3, RepC3, [256, 0.5]] # 27-P4/16

  - [18, 1, Conv, [512, 3, 2]] # 28-P5/32
  - [28, 1, Conv, [512, 3, 2]] # 29-P5/32
  - [[-1, -2, 14], 1, Concat, [1]] # 30-P5/32
  - [-1, 3, RepC3, [256, 0.5]] # 31-P5/32

  - [[24, 28, 32], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)