# Ultralytics YOLO ?, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

# From BiliBili Ä§¹íÃæ¾ß
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, C2f_DynamicFilter, [128, 160]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, C2f_DynamicFilter, [256, 80]]
  - [-1, 1, Conv, [384, 3, 2]]  # 5-P4/16
  - [-1, 1, C2f_DynamicFilter, [384, 40]]
  - [-1, 1, Conv, [384, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f_DynamicFilter, [384, 20]]

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 9
  - [-1, 1, Conv, [256, 1, 1]]  # 10, Y5, lateral_convs.0

  - [-1, 1, FSA, [20]] # 11-P5/32
  - [6, 1, FSA, [40]] # 12-P4/16
  - [4, 1, FSA, [80]] # 13-P3/8

  - [12, 1, nn.Upsample, [None, 2, 'nearest']] # 14
  - [13, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 15 input_proj.1
  - [[-2, -1], 1, Concat, [1]] # 16
  - [-1, 3, RepC3, [256, 0.5]]  # 17, fpn_blocks.0
  - [-1, 1, Conv, [256, 1, 1]]   # 18, Y4, lateral_convs.1

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 19
  - [14, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 20 input_proj.0
  - [[-2, -1], 1, Concat, [1]]  # 21 cat backbone P4
  - [-1, 3, RepC3, [256, 0.5]]    # X3 (22), fpn_blocks.1

  - [-1, 1, Conv, [256, 3, 2]]   # 23, downsample_convs.0
  - [[-1, 19], 1, Concat, [1]]  # 24 cat Y4
  - [-1, 3, RepC3, [256, 0.5]]    # F4 (25), pan_blocks.0

  - [-1, 1, Conv, [256, 3, 2]]   # 26, downsample_convs.1
  - [[-1, 12], 1, Concat, [1]]  # 27 cat Y5
  - [-1, 3, RepC3, [256, 0.5]]    # F5 (28), pan_blocks.1

  - [[23, 26, 29], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)